In [2]:
import pandas as pd
import numpy as np
import datetime as dt
from pathlib import Path
import seaborn as sns
%matplotlib inline

In [6]:
s = pd.Series(["Payment, Credit",
               "Travel, Air, Auto",
               "Food, Restaurants"])

In [10]:
col = s.str.split(expand = True)
col[0]

0    Payment,
1     Travel,
2       Food,
Name: 0, dtype: object

In [20]:
col.replace(",", "")

          0            1     2
0  Payment,       Credit  None
1   Travel,         Air,  Auto
2     Food,  Restaurants  None